In [1]:
#%qtconsole
import pandas as pd
import platform

In [2]:
file_name='codevita 2k15 scrapped.csv'
def return_file_path(base_url,file_name,file_seperator,intermediate_folder=''):
    if not intermediate_folder=='':
        intermediate_folder=intermediate_folder+file_seperator
    return '{}{}{}'.format(base_url,intermediate_folder,file_name)

if platform.system()=='Linux':
    base_url=r'/mnt/ECFC8291FC8255AC/Datasets/Codevita Results/'
    file_seperator='/'
else:
    file_seperator='\\'
    base_url='F:\\Datasets\\Codevita Results\\'
    
    

if platform.system()=='Linux':
    results_2k15_df=pd.read_csv(return_file_path(base_url,file_name,file_seperator))
else:
    results_2k15_df=pd.read_csv(return_file_path(base_url,file_name,file_seperator))

In [3]:
results_2k15_df.shape

(2815, 5)

In [4]:
results_2k15_df.describe()

              Rank
count  2815.000000
mean   1408.000000
std     812.764829
min       1.000000
25%     704.500000
50%    1408.000000
75%    2111.500000
max    2815.000000

In [5]:
results_2k15_df.head()

,Rank,Team Name,Users Name,TCS Region,College Name
0,2294,CRUSADERS,Arjun Panicker & Aditya Bharti,Chennai,"Srm Engineering College., Kattankulathur"
1,261,theAces,Sudhanshu Singh & Vikram Jadon,Pune,"Army Institute of Technology,Pune University, ..."
2,2148,RMCoderz,Meghana Reddy & Rushil Basappa,Hyderabad,"Osmania University, Hyderabad"
3,1473,Blazing Bees,Bharat Ramnani & Bhavishya Garg,Mumbai,"Medicaps Inst of Tech & Management, Indore"
4,2764,Rayfield LeGeNdS,Akshay Damodaran & Niranjan Sharma,Mumbai,"Ramrao Adik Institute of Technology,Nerul"

Removing all the spaces from the names of the columns in the DF for easier access as a property of the DF object instead of having to index into a specific column

In [6]:
results_2k15_df['team_name']=results_2k15_df['Team Name']
results_2k15_df=results_2k15_df.drop('Team Name',axis=1)

In [7]:
results_2k15_df['tcs_region']=results_2k15_df['TCS Region']
results_2k15_df=results_2k15_df.drop('TCS Region',axis=1)

In [8]:
results_2k15_df['users_name']=results_2k15_df['Users Name']
results_2k15_df=results_2k15_df.drop('Users Name',axis=1)

In [9]:
results_2k15_df['college_name']=results_2k15_df['College Name']
results_2k15_df=results_2k15_df.drop('College Name',axis=1)

In [10]:
results_2k15_df.head()

,Rank,team_name,tcs_region,users_name,college_name
0,2294,CRUSADERS,Chennai,Arjun Panicker & Aditya Bharti,"Srm Engineering College., Kattankulathur"
1,261,theAces,Pune,Sudhanshu Singh & Vikram Jadon,"Army Institute of Technology,Pune University, ..."
2,2148,RMCoderz,Hyderabad,Meghana Reddy & Rushil Basappa,"Osmania University, Hyderabad"
3,1473,Blazing Bees,Mumbai,Bharat Ramnani & Bhavishya Garg,"Medicaps Inst of Tech & Management, Indore"
4,2764,Rayfield LeGeNdS,Mumbai,Akshay Damodaran & Niranjan Sharma,"Ramrao Adik Institute of Technology,Nerul"

Checking whether each entry of the users_name column has a '&'...if it has two entries, only then will the '&' be present otherwise it will not be present...if not present it will raise an assertion error

In [11]:
assert(sum(results_2k15_df.users_name.apply(lambda x:not '&' in x))==0)

In [12]:
results_2k15_df['user_1']=results_2k15_df.users_name.apply(lambda x:x.split(sep='&')[0].strip())
results_2k15_df['user_2']=results_2k15_df.users_name.apply(lambda x:x.split(sep='&')[1].strip())

Checking for any null entries in user_1 or user_2

In [13]:
assert(results_2k15_df.user_1[results_2k15_df.user_1==''].shape[0]==0)
assert(results_2k15_df.user_2[results_2k15_df.user_2==''].shape[0]==0)

Checking whether the column of tcs_regions contains any invalid entries

In [14]:
results_2k15_df.tcs_region.unique()

array(['Chennai', 'Pune', 'Hyderabad', 'Mumbai', 'Kolkata', 'Delhi',
       'Lucknow', 'Bangalore', 'Trivandrum', 'Ahmedabad'], dtype=object)

Observation: Many colleges have the name of the department attached before them...all of those start with the word 'Dept'

In [15]:
results_2k15_df.college_name[results_2k15_df.college_name.str.startswith('Dept')]

11      Dept of Cs & Electronics, Guru Nanak Universit...
424     Dept of Cs & Electronics, Guru Nanak Universit...
616     Dept. of Computer Science & Technology, Goa Un...
835     Dept of Cs & Electronics, Guru Nanak Universit...
871     Dept of Cs & Electronics, Guru Nanak Universit...
967     Dept of Cs & Electronics, Guru Nanak Universit...
1083    Dept of Cs & Electronics, Guru Nanak Universit...
1552    Dept of Cs & Electronics, Guru Nanak Universit...
1743    Dept of Cs & Electronics, Guru Nanak Universit...
1764    Dept of Cs & Electronics, Guru Nanak Universit...
1978    Dept of Cs & Electronics, Guru Nanak Universit...
2096    Dept. of Computer Science & Technology, Goa Un...
2135    Dept of Cs & Electronics, Guru Nanak Universit...
2192    Dept of Cs & Electronics, Guru Nanak Universit...
2392    Dept of Cs & Electronics, Guru Nanak Universit...
2426    Dept of Cs & Electronics, Guru Nanak Universit...
2650    Dept of Cs & Electronics, Guru Nanak Universit...
2755    Dept of Cs & Electronics, Guru Nanak Universit...
Name: college_name, dtype: object

In [16]:
results_2k15_df.college_name[results_2k15_df.college_name.str.startswith('Dept')].unique()

array(['Dept of Cs & Electronics, Guru Nanak University, Amritsar',
       'Dept. of Computer Science & Technology, Goa University'], dtype=object)

Extracting the name of the college from the above results...note that we can extract the results by splitting it at the occurence of the first comma

In [17]:
results_2k15_df.college_name=results_2k15_df.college_name.apply(lambda x:x.split(sep=',')[1] if x.startswith('Dept') else x)

In [18]:
results_2k15_df.college_name[results_2k15_df.college_name.str.startswith('Dept')]

Series([], Name: college_name, dtype: object)

Checking for empty values in team_name

In [19]:
results_2k15_df.team_name[results_2k15_df.team_name=='']

Series([], Name: team_name, dtype: object)

In [20]:
college_df=pd.DataFrame(results_2k15_df,columns=['college_name','tcs_region'])

In [21]:
college_df.shape

(2815, 2)

In [22]:
college_df.head()

                                        college_name tcs_region
0           Srm Engineering College., Kattankulathur    Chennai
1  Army Institute of Technology,Pune University, ...       Pune
2                      Osmania University, Hyderabad  Hyderabad
3         Medicaps Inst of Tech & Management, Indore     Mumbai
4          Ramrao Adik Institute of Technology,Nerul     Mumbai

In [23]:
college_df=college_df.drop_duplicates()
college_df.college_name=college_df.college_name.str.strip()

In [24]:
college_df.to_csv(return_file_path(base_url,'college_list_2k15.csv',file_seperator,intermediate_folder='generated_preprocessing'))

In [25]:
results_2k15_df.to_csv(return_file_path(base_url,'codevita_2k15_preprocessed.csv',file_seperator,intermediate_folder='generated_preprocessing'))